import pandas as pd

# 데이터
profit = {
    2022: -2970703,
    2021: 6764718,
    2020: 2198125,
    2019: 2419889,
    2018: 7716007,
    2017: 14640831293241,
    2016: 13499994433319,
    2015: 7711931123344,
    2014: 3442156476970,
    2013: 962250860117,
    2012: 42724893597221,
    2011: 3319345069425,
    2010: 3259478279437,
    2009: -1058371171513,
    2008: 4431853298081,
    2007: 4971104818401,
    2006: 5440325534169,
    2005: 5761596170456,
}

# 키를 문자열로 변환
profit_str = {str(year): value for year, value in profit.items()}

# 딕셔너리를 데이터프레임으로 변환
profit_df = pd.DataFrame(list(profit_str.items()), columns=["Year", "Profit"])

print(profit_df)
